class CORPUS:
    
    FOLD = ['弃牌','🈚️了','没我了','扔掉','白白👋🏻','再见','无我了','这局没我','你们玩','算了，免费看戏',
           '看你们表演','曾经有一个智者告我这牌不该弃🤔','战术弃牌👋🏻','再玩我是龟子','龟子不弃','nb，弃了',
           '你们玩，哈哈，你们玩','我刷会微博哈','我刷会小红书','我刷会豆瓣','我刷会虎扑','我刷会知乎',
           '普弃','小弃','硬弃',]

    CHECK = ['过','敲敲','叩叩','nb，过了','先过吧','我过','没牌不得过么','曾经有一个智者告我这牌不该过🤔',
               '免费往下看','战术敲敲','先过再看','加就弃','5块打跑','别搞事情哈','龟子不过','怕怕','普过','小过',
               '硬过',]

    CALL = ['跟','吓唬谁呢','跟上','跟起来','我跟','跟他妈的','跟了啊','跟呗','谁怕谁','谁还不敢跟了啊',
               '龟子不跟','曾经有一个智者告我这牌不该跟🤔','那还不敢跟了啊那还','有牌啊意思是','你没牌啊，何必呢',
               '嚯，啥牌啊','就硬玩啊','硬跟一把哈','哦唷，怕怕😥','就这🤔','爷笑了😝','nb，跟了',
               '顺子呗🤔','同花呗','三条呗','同花顺呗👍','又葫芦啦👍','有我','笑了😄','属实笑了','直接笑了',
               '简跟','普跟','小跟','硬跟',]

    RAISE = ['加','加他妈的','加起来','加啊','就干你','曾经有一个智者告我这牌不该加🤔','我有牌啊','我对ACE啊',
             '为AK正名啊','不信对K站不住哈','呵呵，AK在手','不好意思，有ACE就是这么狂哈','起个高调','爷就硬加',
             '龟子不加','就这些','加了啊，谁赞成谁反对','送给有缘人','我就等一条ACE','发个K马上 all in','听顺了啊',
             '听花了啊','小葫芦成型了啊','来吧，小刀拉腚','我就一对3','来吧，你 all 我就跟','就这些哈',]

    ALLIN = ['走起来！','ALLIN！！','推他妈的！！','就这些了啊！！','我数数啊','我看看谁不服哈','我小红牌呢',
             '曾经有一个智者告我这牌不该 all in🤔','不过了！！',]

    SMALLTALK = ['哈哈','nb','日了','牌不行','荷官给点力啊','这啥牌','我吐了','我吐了呀','我服了',
                 '我他妈吐了','我他妈吐了啊','给爷整笑了','爷吐了','呵呵','嘻嘻','嘿嘿','哼哼','舒适了',
                 '属实舒适','属实舒适了属于是','属实吐了','什么几把牌','这牌玩个几把','玩个几把这牌',]

    TRASHTALK = ['加油啊','能行吗','钱还够不','哟，送钱来了啊','放松点，别紧张','智者带了吗','没关系，输就输了呀',
                 '敢玩吗','还能玩动吗','不行歇会儿啊','是不困了啊','来个红牛不','智者不会就是你吧','玩得挺好的',
                 '等你 all in 喔','坚持住啊','今儿应该能行哈',]
    
    BUYIN = ['爷回来了','想不到吧','爷又回来了','又有我了','嘿嘿','嘻嘻',]

    BYE = ['这下真白白了👋🏻','再见各位','你们慢慢玩哈','翻屋训觉😴','下桌，告辞',]
