AI_NAMES = ['云师','jimmy仔','修师','范师','西米','铁锤','Zakk','胡哥','六爷','莎翁',]

AI_NAMES_EXT = ['姆巴佩','哈兰德','刘凯龙','马化腾','马斯克','Zuckerberg','乔布斯',]

CORPUS = {
    'FOLD':['弃牌','🈚️了','没我了','扔掉','白白👋🏻','再见','无我了','这局没我','你们玩','算了，免费看戏',
    '看你们表演',],

    'CHECK':['过','敲敲','叩叩','nb，过了','先过吧','我过',],

    'CALL':['跟','跟上','跟起来','我跟','跟他妈的','跟了啊',],

    'RAISE':['加','加他妈的','加起来','加啊',],

    'ALLIN':['走起来！','ALLIN！！','推他妈的！！','就这些了啊！！','我数数啊','我看看谁不服哈','我小红牌呢',],

    'SMALLTALK':['哈哈','nb','日了','牌不行','荷官给点力啊','这啥牌','我吐了','我吐了呀','我服了',
    '我他妈吐了','我他妈吐了啊',],

    'TRASHTALK':['加油啊','能行吗','放松点，别紧张','没关系，输就输了呀','敢玩吗','还能玩动吗',]
}